config.org
:DOC-CONFIG:
#+PROPERTY: header-args: emacs-lisp :tangle config.el
#+PROPERTY: header-args :mkdirp yes :comments no :tangle yes :results silent
#+STARTUP: overview
:END:
#+TITLE: Marty's Doom Emacs Configuration
#+AUTHOR: Marty Buchaus
#+EMAIL: marty@dabuke.com

* Table
+ [[Header and General]]
+ [[Spelling]]
+ [[Fly check]]
+ [[User Interface]]
+ [[Key Binding]]
+ [[Org]]
+ [[Functions]]
+ [[Other Tools]]
* Documentation Links
** Dired
-  [[https://doomemacs.discourse.group/t/dired-keybind-reference-sheet/127?u=mbuchaus][Doom Discourse dired keymap]],

* Header and General
Base Global configuration options and settings

 #+BEGIN_SRC emacs-lisp

;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programming source file located at
;; https://gitlab.com/zzamboni/dot-doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

(setq user-full-name "Marty Buchaus"
      user-mail-address "marty@dabuke.com")

(setq-default delete-by-moving-to-trash t)         ; Move to Trash
(setq-default create-lockfiles nil)                ; NO Lockfiles
(setq-default tab-width 4)                         ; Set width for tabs
(setq-default uniquify-buffer-name-style 'forward) ; Uniquify buffer names
(setq-default window-combination-resize t)         ; take new window space from all other windows (not just current)
(setq-default x-stretch-cursor t)                  ; Stretch cursor to the glyph width

(setq undo-limit 80000000)                ; Raise undo-limit to 80Mb
(setq evil-want-fine-undo t)              ; By default while in insert all changes are one big blob. Be more granular
(setq auto-save-default t)                ; Nobody likes to loose work, I certainly don't
(setq inhibit-compacting-font-caches t)   ; When there are lots of glyphs, keep them in memory
(setq truncate-string-ellipsis "…")       ; Unicode ellipsis are nicer than "...", and also save /precious/ space

(delete-selection-mode 1)                 ; Replace selection when inserting text
(display-time-mode 1)                     ; Enable time in the mode-line
(global-subword-mode 1)                   ; Iterate through CamelCase words

(add-to-list 'load-path "~/.config/doom/elisp")

(add-hook 'doom-init-ui-hook #'spacemacs/home)
(remove-hook 'org-load-hook #'+org-init-keybinds-h)
#+END_SRC
* Spelling

Useing the spell-fu of doom with aspell.

#+BEGIN_SRC emacs-lisp

(setq ispell-dictionary "en_US")
(setq ispell-personal-dictionary (expand-file-name ".ispell_personal" doom-private-dir))

#+END_SRC
* Fly check
Get me some checking
#+BEGIN_SRC emacs-lisp

(setq flycheck-global-modes '(not org-mode))

#+END_SRC

* User Interface
** AVY
#+BEGIN_SRC emacs-lisp
(after! avy
  ;; home row priorities: 8 6 4 5 - - 1 2 3 7
  (setq avy-keys '(?n ?e ?i ?s ?t ?r ?i ?a)))
#+END_SRC

** Company
*** Misc

#+BEGIN_SRC emacs-lisp

(after! company
  (setq company-idle-delay 0.5
        company-minimum-prefix-length 2)
  (setq company-show-numbers t)
  (add-hook 'evil-normal-state-entry-hook #'company-abort)) ;; make aborting less annoying


(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+END_SRC

*** Plain Text
#+BEGIN_SRC emacs-lisp
(set-company-backend!
  '(text-mode
    markdown-mode
    gfm-mode)
  '(:seperate
    company-ispell
    company-files
    company-yasnippet))
#+END_SRC

** Font
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "DejaVu Sans Mono" :size 10.5 )
      doom-unicode-font (font-spec :family "Symbola" :size 12)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15)
      doom-big-font (font-spec :family "DejaVu Sans Mono" :size 20))

(custom-set-faces!
  '(mode-line :family "DejaVu Sans Mono" :height 105)
  '(mode-line-inactive :family "DejaVu Sans Mono" :height 105))
#+end_src

Mixed Pitch Font setting

#+BEGIN_SRC emacs-lisp

(autoload #'mixed-pitch-serif-mode "mixed-pitch"
  "Change the default face of the current buffer to a serifed variable pitch, while keeping some faces fixed pitch." t)

(after! mixed-pitch
  (defface variable-pitch-serif
    '((t (:family "serif")))
    "A variable-pitch face with serifs."
    :group 'basic-faces)
  (setq mixed-pitch-set-height t)
  (setq variable-pitch-serif-font (font-spec :family "Ubuntu" :size 27))
  (set-face-attribute 'variable-pitch-serif nil :font variable-pitch-serif-font)
  (defun mixed-pitch-serif-mode (&optional arg)
    "Change the default face of the current buffer to a serifed variable pitch, while keeping some faces fixed pitch."
    (interactive)
    (let ((mixed-pitch-face 'variable-pitch-serif))
      (mixed-pitch-mode (or arg 'toggle)))))

(set-char-table-range composition-function-table ?f '(["\\(?:ff?[fijlt]\\)" 0 font-shape-gstring]))
(set-char-table-range composition-function-table ?T '(["\\(?:Th\\)" 0 font-shape-gstring]))
#+END_SRC

** IVY
#+BEGIN_SRC emacs-lisp
(setq ivy-read-action-function #'ivy-hydra-read-action)
(setq ivy-sort-max-size 50000)
(setq +ivy-buffer-preview t)
#+END_SRC

** Line Number

I like the Relative Line Numbering

#+BEGIN_SRC emacs-lisp

(setq-default linum-format "%4d \u2502")
(setq-default linum-relative-format "%4s \u2502")
(setq display-line-numbers-type nil)

#+END_SRC

** Mode line
#+BEGIN_SRC emacs-lisp

(setq doom-modeline-height 30)
(setq doom-modeline-major-mode-icon t)
(setq doom-modeline-github t)
(setq doom-modeline-persp-name t)

#+END_SRC

** Theme

And then from =config.el= we specify the theme to use.

#+begin_src emacs-lisp
(setq doom-theme 'doom-dracula)
(setq doom-themes-treemacs-theme "doom-colors")
#+end_src

** Tree macs
#+BEGIN_SRC emacs-lisp

(use-package! treemacs
  :init
  (setq +treemacs-git-mode 'deferred))

#+END_SRC

** Which Key
#+BEGIN_SRC emacs-lisp
(setq which-key-idle-secondary-delay 0.5)
(setq which-key-allow-multiple-replacements t)

(after! which-key
  (pushnew!
   which-key-replacement-alist
   '(("" . "\\`+?evil[-:]?\\(?:a-\\)?\\(.*\\)") . (nil . "◂\\1"))
   '(("\\`g s" . "\\`evilem--?motion-\\(.*\\)") . (nil . "◃\\1"))
   ))
#+END_SRC

* Key Binding

I have adapted to the Spacemacs method of Key Binding. yet I see much More traction on the Doom repos.
#+BEGIN_SRC emacs-lisp


(global-set-key (kbd "C-:") '+spell/correct)
(global-set-key (kbd "C-<") '+spell/next-error)


;; (setq doom-leader-key "SPC"
;;       doom-localleader-key ",")

;; (define-key input-decode-map [(control ?i)] [control-i])
;; (define-key input-decode-map [(control ?I)] [(shift control-i)])
;; (map! :map 'evil-motion-state-map "C-i" nil)
;; (define-key evil-motion-state-map [control-i] 'evil-jump-forward)

;; (map! (:after help :map helpful-mode-map
;;        :n "h"      #'helpful-at-point))

;; (map! :leader
;;       :desc "List bookmarks"                          "b L" #'list-bookmarks
;;       :desc "Save current bookmarks to bookmark file" "b w" #'bookmark-save
;;       :desc "M-x"                                     "SPC" #'counsel-M-x

;;       ;;; <leader> a --- Application
;;       ;;;
;;       (:prefix ("a" . "application")
;;        (:prefix ("d" . "dired")
;;         "-"  #'dired)
;;        (:prefix ("o" . "org")
;;         "a"  #'org-agenda
;;         (:prefix ("r" . "roam")
;;          (:prefix ("d" . "dailies")
;;           "t"  #'org-roam-dailies-find-today)))
;;        :desc "Pass" "p" #'ivy-pass)

;;       ;;; <leader> g --- git
;;       (:prefix ("g" . "magit")
;;        "s" #'magit-status)

;;       ;;; <leader> h --- help
;;       (:prefix ("h")
;;        "h" #'helpful-at-point)

;;       ;;; <leader> l --- layout/workspace
;;       (:when (featurep! :ui workspaces)
;;        (:prefix ("l" . "workspace")
;;         :desc "Display tab bar"           "l"   #'+workspace/display
;;         :desc "Switch workspace"          "."   #'+workspace/switch-to
;;         :desc "Switch to last workspace"  "`"   #'+workspace/other
;;         :desc "New workspace"             "n"   #'+workspace/new
;;         :desc "Load workspace from file"  "L"   #'+workspace/load
;;         :desc "Save workspace to file"    "s"   #'+workspace/save
;;         :desc "Delete session"            "x"   #'+workspace/kill-session
;;         :desc "Delete this workspace"     "d"   #'+workspace/delete
;;         :desc "Rename workspace"          "r"   #'+workspace/rename
;;         :desc "Restore last session"      "R"   #'+workspace/restore-last-session
;;         :desc "Next workspace"            "l"   #'+workspace/switch-right
;;         :desc "Previous workspace"        "h"   #'+workspace/switch-left
;;         :desc "Switch to 1st workspace"   "1"   #'+workspace/switch-to-0
;;         :desc "Switch to 2nd workspace"   "2"   #'+workspace/switch-to-1
;;         :desc "Switch to 3rd workspace"   "3"   #'+workspace/switch-to-2
;;         :desc "Switch to 4th workspace"   "4"   #'+workspace/switch-to-3
;;         :desc "Switch to 5th workspace"   "5"   #'+workspace/switch-to-4
;;         :desc "Switch to 6th workspace"   "6"   #'+workspace/switch-to-5
;;         :desc "Switch to 7th workspace"   "7"   #'+workspace/switch-to-6
;;         :desc "Switch to 8th workspace"   "8"   #'+workspace/switch-to-7
;;         :desc "Switch to 9th workspace"   "9"   #'+workspace/switch-to-8
;;         :desc "Switch to final workspace" "0"   #'+workspace/switch-to-final))

;;       ;;; <leader> n --- Notes
;;       (:prefix ("n")
;;        :desc "roam daily capture" "j" #'org-roam-dailies-capture-today)


;;       ;;; <leader> o --- Open
;;       (:prefix-map ("o" . "open")
;;        (:prefix-map ("m" . "my-files")
;;         :desc "0 Mobile"   "0" #'(lambda () (interactive) (find-file "~/Nextcloud/Notes/org/0mobile.org"))
;;         :desc "Contacts"   "c" #'(lambda () (interactive) (find-file "~/Nextcloud/Notes/org/contacts.org"))
;;         :desc "Tasks"      "g" #'(lambda () (interactive) (find-file "~/Nextcloud/Notes/org/Tasks.org"))
;;         :desc "Someday"    "s" #'(lambda () (interactive) (find-file "~/Nextcloud/Notes/org/Someday.org"))
;;         :desc "Read Later" "R" #'(lambda () (interactive) (find-file "~/Nextcloud/Notes/org/read-later.org"))
;;         :desc "Habits"     "h" #'(lambda () (interactive) (find-file "~/Nextcloud/Notes/org/Habits.org"))))

;;       ;;; <leader> p --- Projectile
;;       (:prefix ("p")
;;        :desc "dired in project"  "-"  #'projectile-dired)

;;       ;;; <leader> S --- Spelling
;;       (:prefix-map ("S" . "spelling")
;;        :desc "Correct here"  "c"  #'+spell/correct
;;        :desc "add word"      "a"  #'+spell/add-word
;;        :desc "next error"    "n"  #'+spell/next-error
;;        :desc "prev error"    "p"  #'+spell/previous-error
;;        :desc "remove word"   "d"  #'+spell/remove-word))
  #+END_SRC

* Org
** Base
Set the Directories base.

#+BEGIN_SRC emacs-lisp
;;; Org-mode Start

(setq org-directory "~/Nextcloud/Notes/org")
(setq org-roam-directory "~/Nextcloud/Notes/org")

#+END_SRC

** Org Look
#+BEGIN_SRC emacs-lisp
(after! org

;;;; Faces

  (setq org-todo-keyword-faces
        '(("TODO"       . org-warning)
          ("NEXT"       . (:foreground "#008080" :weight bold))
          ("STARTED"    . (:foreground "#E35DBF" :weight bold))
          ("BLOCKED"    . (:foreground "White"   :weight bold))
          ("TODELEGATE" . (:foreground "White"   :weight bold))
          ("DELEGATED"  . (:foreground "pink"    :weight bold))
          ("CANCELED"   . (:foreground "white"   :weight bold))
          ("TICKLE"     . (:foreground "White"   :weight bold))
          ("DONE"       . (:foreground "green"   :weight bold))))

;;;; Symbols

  (setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "†")
                                         ("#+END_SRC" . "†")
                                         ("#+begin_src" . "†")
                                         ("#+end_src" . "†")
                                         ("#+BEGIN_EXAMPLE" . ">EG>")
                                         ("#+begin_example" . ">EG>")
                                         ("#+END_EXAMPLE" . "<EG<")
                                         ("#+end_example" . "<EG<")
                                         ("[ ]" . "☐")
                                         ("[X]" . "☑")
                                         ("[-]" . "⊡")
                                         (">=" . "≥")
                                         ("=>" . "⇨")))

  (prettify-symbols-mode 1))

#+END_SRC


** Set misc
I want  indentation
#+BEGIN_SRC emacs-lisp
(after! org
  
  (setq org-catch-invisible-edits 'show-and-error)
  (setq org-clock-into-drawer "CLOCKING")          ;; Where to put the clock in and out for tracked items
  (setq org-clock-out-remove-zero-time-clocks t)
  (setq org-cycle-separator-lines 0)               ;; show no blank lines between headings
  (setq org-src-tab-acts-natively t)               ;; Make source tabs act as they would in native major mode
  (setq org-icalendar-store-UID t)
  (setq org-id-track-globally t)
  (setq org-log-done t)
  (setq org-log-into-drawer t)
  (setq org-log-reschedule t)
  (setq org-contacts-files '("~/Nextcloud/Notes/org/contacts.org"))
  (setq org-want-todo-bindings t)
  (setq org-tags-column -80)

  (setq org-startup-indented t)
  (setq org-indent-indentation-per-level 2)
  (setq org-src-tab-acts-natively t)

  ;; make for a cleaner look of the buffer

  (setq org-hide-emphasis-markers t)
  (setq org-fontify-done-headline t)
  (setq org-hide-leading-stars t)
  (setq org-pretty-entities t)
  (setq org-fontify-done-headline t)
  (setq org-fontify-whole-heading-line t)
  (setq org-fontify-quote-and-verse-blocks t)

  ;;;; Attachemnt
  (setq org-attach-dir-relative t)
  (setq org-attach-preferred-new-method 'ask)
  (setq org-attach-use-inheritance t)

  ;;;; Habits
  
  (setq org-habit-graph-column 60)
  )
  #+END_SRC
